/*
 *
 *	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠻⠗⢶⣶⣶⣦⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀
 *	⠀⠀⠀⠀⣀⡀⣤⡄⠀⠀⠀⠀⢸⠟⡄⠀⠘⠉⠛⠀⠀⠀⠀⠀⠀⠀
 *	⠀⠀⠀⠀⠉⢻⠇⠀⠀⠀⡀⢴⠝⣄⣷⣀⠀⠀⠀⠀⠀⠀⠀bikeshare.
 *	⠀⠀⠀⠀⠀⠈⣦⠀⡠⡪⢲⠃⡜⢉⣧⣿⣧⣤⣤⣤⣄⡀⠀⠀⠀⠀
 *	⠀⢀⣠⣴⣤⣴⣿⡕⠈⡠⣡⠌⠀⣼⢿⠿⢿⡏⠉⠛⠻⣿⣷⣤⠀⠀
 *	⢠⡾⠁⡴⠋⢿⣷⠃⡔⣱⠃⢀⣾⡟⢻⡆⠘⣷⠀⠀⠀⠀⠻⣿⣷⡀
 *	⣸⢁⣾⣅⣀⡜⢻⡜⡠⠁⠀⣼⣿⠀⠘⣿⣴⣻⡶⡄⠀⠀⠀⢹⣿⣧
 *	⢻⡘⢻⠀⠈⣿⣿⠗⠉⠀⠀⢿⣇⠀⠀⠈⣿⠛⢃⡇⠀⠀⠀⢸⣿⣿
 *	⠈⢷⣧⣨⣾⣯⡿⠀⠀⠀⠀⠸⣿⡄⠀⠀⠈⠉⠉⠀⠀⠀⢀⣿⣿⡏
 *	⠀⠀⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣦⣀⠀⠀⠀⠀⢀⣠⣿⣿⠟⠀
 *	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠿⣿⣶⣶⣿⣿⠿⠛⠁⠀⠀
 *
 * =================================================
 *
 * @file main.c
 *
 * @brief The Main Function
 * @authors ruantmelo@gmail.com & vcn0510@gmail.com
 *
 * =================================================
 */

#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>

#include "config.h"
#include "state.h"
#include "led.h"
#include "sensor.h"

LOG_MODULE_REGISTER(bikeshare, LOG_LEVEL_INF);

int main(void)
{
	LOG_INF("Bikeshare Firmware iniciando...");

	bike_config_init();
	led_status_init();
	bike_state_init();
	motion_sensor_init();

	return 0;
}
